name: "ensemble_model"
# maximum batch size 
max_batch_size: 0 
platform: "ensemble"

#input to the model 
input [
{
    name: "TEXT"
    data_type: TYPE_STRING
    dims: [ -1 ] 
    # -1 means dynamic axis, aka this dimension may change 
}
]

#output of the model 
output {
    name: "output_0"
    data_type: TYPE_FP32
    dims: [-1, -1] 
    # two dimensional tensor, where 1st dimension: batch-size, 2nd dimension: #classes
}

#Type of scheduler to be used
ensemble_scheduling {
    step [
        {
            model_name: "tokenizer"
            model_version: -1
            input_map {
            key: "TEXT"
            value: "TEXT"
        }
        output_map [
          {
            name: "input_ids"
            data_type: TYPE_INT32
            dims: [-1]
          },
          {
            name: "attention_mask"
            data_type: TYPE_INT32
            dims: [-1]
          },
          {
            name: "token_type_ids"
            data_type: TYPE_INT32
            dims: [-1]
          }
        ]
        },
        {
          model_name: "retrieve"
          model_version: -1
          input_map [
            {
              name: "input_ids"
              data_type: TYPE_INT32
              dims: [-1]
            },
            {
              name: "attention_mask"
              data_type: TYPE_INT32
              dims: [-1]
            },
            {
              name: "token_type_ids"
              data_type: TYPE_INT32
              dims: [-1]
            }
          ]
          output_map {
              key: "embedding"
              value: "output_0"
          }
        }
    ]
}