name: "qwen3-retrieve-sym.model"
platform: "onnxruntime_onnx"
default_model_filename: "model.onnx"
max_batch_size: 0
version_policy: {
  all: {
  }
}

input [
{
  name: "input_ids"
  data_type: TYPE_INT64
  dims: [ -1, -1 ]
},
{
  name: "attention_mask"
  data_type: TYPE_INT64
  dims: [ -1, -1 ]
}
]

output [
  {
  name: "sentence_embedding_quantized"
  data_type: TYPE_UINT8
  dims: [ -1, 1024]
}
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
    gpus: [0]  # gpu device = 0
  }
]